noless-zz/esp8266-led-strip-clock/src/main.cpp
void saveModeConfigToEEPROM(uint8_t mode) {
  if (mode >= DISPLAY_MAX) return;
  int addr = EEPROM_MODE_CFG_BASE_ADDR + (int)mode * (int)sizeof(ModeDisplayConfig);
  EEPROM.begin(EEPROM_SIZE);
  const uint8_t *raw = reinterpret_cast<const uint8_t*>(&modeConfigs[mode]);
  for (unsigned int i = 0; i < sizeof(ModeDisplayConfig); i++) {
    EEPROM.write(addr + (int)i, raw[i]);
  }
  EEPROM.write(EEPROM_MODE_CFG_MAGIC_ADDR, EEPROM_MODE_CFG_MAGIC);
  EEPROM.commit();
}

void loadModeConfigsFromEEPROM() {
  setDefaultModeConfigs();
  EEPROM.begin(EEPROM_SIZE);

  if (EEPROM.read(EEPROM_MODE_CFG_MAGIC_ADDR) != EEPROM_MODE_CFG_MAGIC) {
    for (uint8_t m = 0; m < DISPLAY_MAX; m++) {
      saveModeConfigToEEPROM(m);
    }
    return;
  }

  for (uint8_t m = 0; m < DISPLAY_MAX; m++) {
    int addr = EEPROM_MODE_CFG_BASE_ADDR + (int)m * (int)sizeof(ModeDisplayConfig);
    ModeDisplayConfig loaded;
    uint8_t *raw = reinterpret_cast<uint8_t*>(&loaded);
    for (unsigned int i = 0; i < sizeof(ModeDisplayConfig); i++) {
      raw[i] = EEPROM.read(addr + (int)i);
    }
    if (isModeConfigValid(loaded)) {
      modeConfigs[m] = loaded;
    }
  }
}

void loadEEPROMSettings() {
  EEPROM.begin(EEPROM_SIZE);
  uint8_t magic = EEPROM.read(EEPROM_MAGIC_ADDR);
  if (magic != EEPROM_MAGIC) {
    EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
    EEPROM.write(EEPROM_DISPLAY_MODE_ADDR, (uint8_t)displayMode);
    EEPROM.commit();
    loadModeConfigsFromEEPROM();
    Serial.println("[EEPROM] Initialized new settings");
    return;
  }
  
  // Load WiFi SSID â€” reject if any byte is non-printable (garbage/uninitialized EEPROM)
  String ssid = "";
  bool ssidValid = true;
  for (int i = 0; i < MAX_SSID_LEN; i++) {
    char c = EEPROM.read(EEPROM_SSID_ADDR + i);
    if (c == 0) break;
    if (c < 0x20 || c > 0x7E) { ssidValid = false; break; }
    ssid += c;
  }
  if (!ssidValid || ssid.length() == 0) {
    Serial.println("[EEPROM] No valid WiFi credentials stored");
  } else {
    String pass = "";
    for (int i = 0; i < MAX_PASS_LEN; i++) {
      char c = EEPROM.read(EEPROM_PASS_ADDR + i);
      if (c == 0) break;
      pass += c;
    }
    Serial.println("[EEPROM] Loaded WiFi: " + ssid);
    // DEBUG: dump password bytes to verify EEPROM integrity
    Serial.printf("[EEPROM] Pass len=%d chars: [", pass.length());
    for (unsigned int i = 0; i < pass.length(); i++) {
      Serial.printf("%c(0x%02X)", pass[i], (uint8_t)pass[i]);
      if (i < pass.length() - 1) Serial.print(' ');
    }
    Serial.println("]");
    savedSsid = ssid;
    savedPass = pass;  // will be used in setupWiFi() after AP is up
  }
  
  // Load brightness
  uint8_t br = EEPROM.read(EEPROM_BRIGHTNESS_ADDR);
  if (br > 0 && br <= 255) ledBrightness = br;

  // Load LED type
  uint8_t rgbwFlag = EEPROM.read(EEPROM_RGBW_ADDR);
  if (rgbwFlag == 0x01 || rgbwFlag == 0x00) ledRgbw = (rgbwFlag == 0x01);

  // Load LED direction
  uint8_t revFlag = EEPROM.read(EEPROM_REVERSED_ADDR);
  if (revFlag == 0x01 || revFlag == 0x00) ledReversed = (revFlag == 0x01);
  
  // Load timezone offset
  int32_t tzOff = (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 0) << 24) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 1) << 16) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 2) << 8) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 3));
  if (tzOff != 0 && tzOff >= -43200 && tzOff <= 43200) tz.utcOffset = tzOff;
  
  // Load display mode
  uint8_t mode = EEPROM.read(EEPROM_DISPLAY_MODE_ADDR);
  if (mode < DISPLAY_MAX) displayMode = (DisplayMode)mode;

  loadModeConfigsFromEEPROM();
}

void saveEEPROMSettings(const String& ssid, const String& pass) {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
  
  for (int i = 0; i < MAX_SSID_LEN; i++) {
    EEPROM.write(EEPROM_SSID_ADDR + i, i < ssid.length() ? ssid[i] : 0);
  }
  
  for (int i = 0; i < MAX_PASS_LEN; i++) {
    EEPROM.write(EEPROM_PASS_ADDR + i, i < pass.length() ? pass[i] : 0);
  }
  
  EEPROM.write(EEPROM_BRIGHTNESS_ADDR, ledBrightness);
  EEPROM.write(EEPROM_TZ_OFFSET_ADDR + 0, (tz.utcOffset >> 24) & 0xFF);
  EEPROM.write(EEPROM_TZ_OFFSET_ADDR + 1, (tz.utcOffset >> 16) & 0xFF);
  EEPROM.write(EEPROM_TZ_OFFSET_ADDR + 2, (tz.utcOffset >> 8) & 0xFF);
  EEPROM.write(EEPROM_TZ_OFFSET_ADDR + 3, tz.utcOffset & 0xFF);
  EEPROM.write(EEPROM_DISPLAY_MODE_ADDR, (uint8_t)displayMode);
  
  EEPROM.commit();
  Serial.println("[EEPROM] Saved settings for " + ssid);
}

// ============================================================================
// Time & Timezone Functions
// ============================================================================

void syncTimeNTP() {
  if (!wifiConnected) return;
  bootStage = BOOT_STAGE_NTP_WAIT;
  Serial.println("[NTP] Syncing with " + String(NTP_SERVER));
  configTime(tz.utcOffset, 0, NTP_SERVER);
  time_t now = time(nullptr);
  int attempts = 50;
  while (now < 86400 && attempts-- > 0) { delay(100); now = time(nullptr); }
  if (now > 86400) {
    Serial.println("[NTP] Time synced");
  }
  lastNtpSync = millis();
}

void detectTimezone() {
  tzDiag.source = "ip-api.com";
  tzDiag.lastAttemptMs = millis();
  tzDiag.status = "running";
  tzDiag.message = "starting detection";
  tzDiag.httpCode = 0;
  tzDiag.responseSample = "";

  if (!wifiConnected) {
    tzDiag.status = "error";
    tzDiag.message = "wifi not connected";
    Serial.println("[GEO] Not connected to WiFi, skipping timezone detection");
    return;
  }
  Serial.println("[GEO] Detecting timezone from IP geolocation...");

  struct TzProvider { const char* host; const char* path; const char* label; };
  TzProvider providers[] = {
    {"ip-api.com", "/json/?fields=status,message,timezone,offset,country,city", "ip-api"},
    {"ipwho.is", "/", "ipwho.is"}
  };

  bool detected = false;
  for (size_t p = 0; p < (sizeof(providers) / sizeof(providers[0])); p++) {
    WiFiClient client;
    tzDiag.source = providers[p].label;

    if (!client.connect(providers[p].host, 80)) {
      tzDiag.status = "error";
      tzDiag.message = String("connect failed to ") + providers[p].host;
      continue;
    }

    client.print("GET ");
    client.print(providers[p].path);
    client.print(" HTTP/1.0\r\nHost: ");
    client.print(providers[p].host);
    client.print("\r\nUser-Agent: LED-Clock/2.0\r\nConnection: close\r\n\r\n");

    String line;
    while (client.connected()) {
      line = client.readStringUntil('\n');
      if (line.startsWith("HTTP/")) {
        int sp = line.indexOf(' ');
        if (sp > 0 && sp + 4 <= line.length()) {
          tzDiag.httpCode = line.substring(sp + 1, sp + 4).toInt();
        }
      }
      if (line == "\r") break;
    }

    String body;
    unsigned long readStart = millis();
    while (millis() - readStart < 5000) {
      while (client.available()) {
        body += (char)client.read();
        readStart = millis();
      }
      if (!client.connected() && !client.available()) break;
      delay(5);
    }
    client.stop();
    body.trim();

    if (body.length() == 0) {
      tzDiag.status = "error";
      tzDiag.message = "empty response body";
      tzDiag.responseSample = "<empty>";
      continue;
    }

