noless-zz/esp8266-led-strip-clock/src/main.cpp
    int startObj = body.indexOf('{');
    int endObj = body.lastIndexOf('}');
    if (startObj >= 0 && endObj > startObj) {
      body = body.substring(startObj, endObj + 1);
    }

    tzDiag.responseSample = body.substring(0, 160);

    DynamicJsonDocument doc(1024);
    DeserializationError error = deserializeJson(doc, body);
    if (error) {
      tzDiag.status = "error";
      tzDiag.message = (body[0] != '{' && body[0] != '[')
        ? ("non-json response (http " + String(tzDiag.httpCode) + ")")
        : ("json parse failed: " + String(error.c_str()));
      continue;
    }

    if (doc["status"] && doc["status"].as<String>() != "success") {
      tzDiag.status = "error";
      tzDiag.message = "api status=" + doc["status"].as<String>() + (doc["message"] ? (", " + doc["message"].as<String>()) : "");
      continue;
    }
    if (doc["success"] && !doc["success"].as<bool>()) {
      tzDiag.status = "error";
      tzDiag.message = "api success=false" + (doc["message"] ? (", " + doc["message"].as<String>()) : "");
      continue;
    }

    String tzName = "";
    int32_t tzOffset = 0;
    bool hasOffset = false;

    if (doc["timezone"] && doc["timezone"].is<const char*>()) {
      tzName = doc["timezone"].as<String>();
    } else if (doc["timezone"] && doc["timezone"].is<JsonObject>() && doc["timezone"]["id"]) {
      tzName = doc["timezone"]["id"].as<String>();
    }

    if (doc["offset"] && !doc["offset"].isNull()) {
      tzOffset = doc["offset"].as<int32_t>();
      hasOffset = true;
    } else if (doc["timezone"] && doc["timezone"].is<JsonObject>() && doc["timezone"]["offset"] && !doc["timezone"]["offset"].isNull()) {
      tzOffset = doc["timezone"]["offset"].as<int32_t>();
      hasOffset = true;
    }

    if (tzName.length() == 0 || !hasOffset) {
      tzDiag.status = "error";
      tzDiag.message = "missing timezone/offset fields";
      continue;
    }

    tz.name = tzName;
    tz.utcOffset = tzOffset;
    tz.autoDetected = true;
    tzDiag.status = "ok";
    tzDiag.message = "timezone=" + tz.name + ", offset=" + String(tz.utcOffset);
    tzDiag.lastSuccessMs = millis();
    detected = true;
    break;
  }

  if (!detected) {
    Serial.println("[GEO] All timezone providers failed: " + tzDiag.message);
    return;
  }
  
  syncTimeNTP();
  lastTzCheck = millis();
}

static const char* wlStatusName(wl_status_t s) {
  switch (s) {
    case WL_IDLE_STATUS:     return "IDLE";
    case WL_NO_SSID_AVAIL:  return "NO_SSID_AVAIL";
    case WL_SCAN_COMPLETED:  return "SCAN_COMPLETED";
    case WL_CONNECTED:       return "CONNECTED";
    case WL_CONNECT_FAILED:  return "CONNECT_FAILED";
    case WL_CONNECTION_LOST: return "CONNECTION_LOST";
    case WL_DISCONNECTED:    return "DISCONNECTED";
    default:                 return "UNKNOWN";
  }
}

void checkWiFi() {
  static unsigned long lastCheck = 0;
  static wl_status_t lastKnownStatus = WL_IDLE_STATUS;
  if (millis() - lastCheck < 5000) return;
  lastCheck = millis();

  wl_status_t status = WiFi.status();

  // Log every status change (even outside an active connect attempt)
  if (status != lastKnownStatus) {
    Serial.printf("[WiFi] checkWiFi: status %s -> %s\n",
                  wlStatusName(lastKnownStatus), wlStatusName(status));
    lastKnownStatus = status;
  }

  bool connected = (status == WL_CONNECTED);
  if (connected != wifiConnected) {
    wifiConnected = connected;
    if (connected) {
      Serial.println("[WiFi] Connected! IP: " + WiFi.localIP().toString() + "  SSID: " + WiFi.SSID());
      detectTimezone();
    } else {
      Serial.printf("[WiFi] Disconnected! Last status: %d (%s)\n", (int)status, wlStatusName(status));
    }
  }
}

// ============================================================================
// WiFi Scanning & Connection
// ============================================================================

String getWifiScanJson() {
  DynamicJsonDocument doc(2048);
  JsonArray arr = doc["networks"].to<JsonArray>();
  
  int scanState = WiFi.scanComplete();
  if (scanState == WIFI_SCAN_RUNNING) {
    doc["scanning"] = true;
  } else if (scanState == WIFI_SCAN_FAILED || scanState < 0) {
    WiFi.scanDelete();
    WiFi.scanNetworks(true, true);
    doc["scanning"] = true;
  } else {
    doc["scanning"] = false;
    scanCacheCount = 0;
    for (int i = 0; i < scanState; i++) {
      String ssid = WiFi.SSID(i);
      if (ssid.length() == 0) continue;
      JsonObject obj = arr.add<JsonObject>();
      obj["ssid"] = ssid;
      obj["rssi"] = WiFi.RSSI(i);
      obj["enc"] = (WiFi.encryptionType(i) != ENC_TYPE_NONE);
      
      if (scanCacheCount < MAX_SCAN_CACHE) {
        scanCache[scanCacheCount].ssid = ssid;
        scanCache[scanCacheCount].rssi = WiFi.RSSI(i);
        scanCache[scanCacheCount].channel = WiFi.channel(i);
        scanCache[scanCacheCount].enc = WiFi.encryptionType(i);
        scanCacheCount++;
      }
    }
    scanCacheUpdatedAt = millis();
    WiFi.scanDelete();
    if (scanState <= 0) {
      WiFi.scanNetworks(true, true);
      doc["scanning"] = true;
    }
  }
  
  String out;
  serializeJson(doc, out);
  return out;
}

bool startWiFiConnect(const String& ssid, const String& pass, bool saveToEeprom = false) {
  if (ssid.length() == 0) {
    Serial.println("[WiFi] startWiFiConnect: SSID is empty, aborting");
    return false;
  }
  if (wifiConnect.active) {
    Serial.println("[WiFi] startWiFiConnect: already connecting, aborting");
    return false;
  }

  Serial.println("[WiFi] --- Connection attempt ---");
  Serial.println("[WiFi] Target SSID : " + ssid);
  // DEBUG: print password bytes to catch any EEPROM corruption
  Serial.printf("[WiFi] Pass (%d): [", pass.length());
  for (unsigned int i = 0; i < pass.length(); i++) Serial.printf("%c", pass[i]);
  Serial.println("]");
  Serial.println("[WiFi] Current status: " + String(WiFi.status()));
  Serial.println("[WiFi] MAC address  : " + WiFi.macAddress());

  wifiConnect.active = true;
  wifiConnect.connecting = true;
  wifiConnect.attemptedSsid = ssid;
  wifiConnect.startedAt = millis();
  wifiConnect.lastStatus = WiFi.status();

  if (saveToEeprom) saveEEPROMSettings(ssid, pass);

  // Check scan cache for channel
  int targetChannel = 0;
  for (int i = 0; i < scanCacheCount; i++) {
    if (scanCache[i].ssid == ssid) {
      targetChannel = scanCache[i].channel;
      Serial.printf("[WiFi] Found in scan cache: ch=%d  rssi=%d  enc=%d\n",
                    scanCache[i].channel, scanCache[i].rssi, scanCache[i].enc);
      break;
    }
  }
  if (targetChannel == 0) {
    Serial.println("[WiFi] Not in scan cache â€” connecting without channel hint");
  }

  // ESP8266 AP+STA constraint: both AP and STA must share the same radio channel.
  // Restart AP on the router's channel before connecting, or STA stays DISCONNECTED.
  if (targetChannel > 0 && targetChannel != (int)WiFi.channel()) {
    Serial.printf("[WiFi] Restarting AP on ch=%d to match router\n", targetChannel);
    WiFi.softAP(AP_SSID, AP_PASS, targetChannel);
  }

  Serial.printf("[WiFi] Calling WiFi.begin(\"%s\", <pass>)\n", ssid.c_str());
  WiFi.begin(ssid.c_str(), pass.c_str());
  Serial.println("[WiFi] WiFi.begin() called, polling for result...");

