noless-zz/esp8266-led-strip-clock/src/main.cpp
<div class='card'><h2>WiFi Configuration</h2>
<div class='form-group'><label>Available Networks <span id='scanStatus' style='font-size:11px;color:#999'></span></label><div class='wifi-row'>
<select id='ssidList' size='6' onchange='networkSelected()'><option value=''>Scanning...</option></select>
<button class='mini-btn' id='scanBtn' onclick='scanWifi()' style='height:36px'>SCAN</button>
</div></div>
<div class='form-group'><label>SSID <span style='font-size:11px;color:#999'>(or type manually)</span></label>
<input type='text' id='wifiSsid' placeholder='Network name' style='font-family:monospace'/></div>
<div class='form-group'><label>Password <span id='openLabel' style='font-size:11px;color:#4a4'></span></label>
<input type='password' id='wifiPass' placeholder='Leave empty for open networks'/></div>
<button class='btn' onclick='connectWifi()'>Connect WiFi</button>
<div class='status-msg' id='wifiMsg'></div>
</div>

<div class='card'><h2>Time & Timezone</h2>
<div class='form-group'><label>NTP Server</label><input type='text' id='ntpServer' value='pool.ntp.org' placeholder='pool.ntp.org'/></div>
<button class='btn btn-secondary' onclick='syncNTP()'>Sync Now</button>

<div class='form-group' style='margin-top:15px'><label>Timezone Mode</label>
<label style='display:flex;align-items:center;margin-top:8px'><input type='radio' name='tzmode' value='auto' checked onchange='toggleTzMode()' style='margin-right:8px'/>Auto-detect</label>
<label style='display:flex;align-items:center;margin-top:8px'><input type='radio' name='tzmode' value='manual' onchange='toggleTzMode()' style='margin-right:8px'/>Manual offset</label></div>

<div id='manualTz' style='display:none'><div class='form-group'><label>UTC Offset (hours, -12 to +14)</label>
<input type='number' id='tzOffset' min='-12' max='14' value='0' placeholder='e.g., -5 for EST'/></div></div>
<button class='btn btn-secondary' onclick='saveTimezone()'>Save Timezone</button>
<div class='status-msg' id='tzMsg'></div>
</div>

<div class='card'><h2>Display Mode</h2>
<div class='form-group'><label>LED Display Style</label>
<select id='displayMode' onchange='saveDisplayMode()' style='width:100%;padding:8px;border:1px solid #ddd;border-radius:4px'>
<option value='0'>Marker Ring (rainbow orbit + HMS)</option>
<option value='1'>Simple HMS (clean 3-LED red/green/blue)</option>
<option value='2'>Pulse (subtle heartbeat + HMS)</option>
<option value='3'>Binary Clock (60 LEDs stretched bits)</option>
<option value='4'>Hour Beacon (minute progress + markers)</option>
<option value='5'>Flame HMS (warm flicker + markers)</option>
<option value='6'>Pastel HMS (soft pink/mint/sky)</option>
<option value='7'>Neon HMS (bright magenta/cyan/yellow)</option>
<option value='8'>Comet Trails (animated HMS tails)</option>
</select></div>
<div style='font-size:11px;color:#888;margin-top:5px' id='modeDesc'>Choose a display mode</div>
<button class='btn btn-secondary' onclick='updateModeDescription()'>Refresh Display</button>
<div class='form-group' style='margin-top:12px'>
<label>Hour Color</label><input type='color' id='hourColor' value='#ff0000' style='width:100%;height:36px;border:1px solid #ddd;border-radius:4px'/>
</div>
<div class='form-group'>
<label>Minute Color</label><input type='color' id='minuteColor' value='#00ff00' style='width:100%;height:36px;border:1px solid #ddd;border-radius:4px'/>
</div>
<div class='form-group'>
<label>Second Color</label><input type='color' id='secondColor' value='#0000ff' style='width:100%;height:36px;border:1px solid #ddd;border-radius:4px'/>
</div>
<div class='form-group'>
<label>Hour Width (pixels)</label><input type='range' id='hourWidth' min='1' max='21' value='5' style='width:100%'/>
<div style='font-size:10px;color:#777'>Pixels: <span id='hourWidthLabel'>5</span></div>
</div>
<div class='form-group'>
<label>Minute Width (pixels)</label><input type='range' id='minuteWidth' min='1' max='21' value='3' style='width:100%'/>
<div style='font-size:10px;color:#777'>Pixels: <span id='minuteWidthLabel'>3</span></div>
</div>
<div class='form-group'>
<label>Second Width (pixels)</label><input type='range' id='secondWidth' min='1' max='30' value='3' style='width:100%'/>
<div style='font-size:10px;color:#777'>Pixels: <span id='secondWidthLabel'>3</span></div>
</div>
<div class='form-group'>
<label>Color Spectrum</label>
<select id='spectrum' style='width:100%;padding:8px;border:1px solid #ddd;border-radius:4px'>
<option value='0'>Static</option>
<option value='1'>Rainbow blend</option>
<option value='2'>Pulse glow</option>
</select>
</div>
<button class='btn btn-secondary' onclick='saveModeConfig()'>Save Mode Visuals</button>
<button class='btn btn-secondary' onclick='resetModeConfig()' style='margin-top:8px;background:#f8f8f8;border:1px solid #ddd;color:#555'>Reset Current Mode to Default</button>
<div class='status-msg' id='modeCfgMsg'></div>
</div>

<div class='card'><h2>Brightness</h2>
<div class='form-group' style='margin-bottom:5px'><label>LED Brightness</label>
<input type='range' id='brightness' min='10' max='255' value='76' oninput='updateBrightnessLabel()' style='width:100%'/></div>
<div style='text-align:center;font-size:12px;color:#666'>
<span id='brightLabel'>30%</span> (<span id='brightValue'>76</span>/255)</div>
<button class='btn btn-secondary' onclick='saveBrightness()'>Save Brightness</button>
</div>

<div class='card'><h2>LED Strip Type</h2>
<div class='form-group' style='display:flex;align-items:center;gap:12px'>
<label style='margin:0'>RGB</label>
<label style='position:relative;display:inline-block;width:48px;height:26px;margin:0'>
<input type='checkbox' id='rgbwToggle' style='opacity:0;width:0;height:0' onchange='saveLedType()'>
<span id='rgbwSlider' style='position:absolute;cursor:pointer;inset:0;background:#ccc;border-radius:26px;transition:.3s'></span>
</label>
<label style='margin:0'>RGBW</label>
</div>
<div style='font-size:11px;color:#888;margin-top:6px'>Current: <span id='ledTypeLabel'>RGB</span> &mdash; change restarts the LED driver</div>
</div>

<div class='card'><h2>LED Direction</h2>
<div class='form-group' style='display:flex;align-items:center;gap:12px'>
<label style='margin:0'>Normal</label>
<label style='position:relative;display:inline-block;width:48px;height:26px;margin:0'>
<input type='checkbox' id='revToggle' style='opacity:0;width:0;height:0' onchange='saveLedDirection()'>
<span id='revSlider' style='position:absolute;cursor:pointer;inset:0;background:#ccc;border-radius:26px;transition:.3s'></span>
</label>
<label style='margin:0'>Reversed</label>
</div>
<div style='font-size:11px;color:#888;margin-top:6px'>Current: <span id='ledDirLabel'>Normal</span> &mdash; flips LED 0&harr;59 for opposite mounting orientation</div>
</div>

