noless-zz/esp8266-led-strip-clock/src/main.cpp
<div class='card'><h2>Firmware Update</h2>
<div class='upload-area' onclick='document.getElementById("fwFile").click()' id='uploadArea'>
<p id='fileName'>ðŸ“ Click to select .bin firmware file</p>
<input type='file' id='fwFile' accept='.bin' style='display:none' onchange='fileSelected(this)'>
</div>
<button class='upload-btn' id='uploadBtn' onclick='uploadFirmware()' disabled>Upload Firmware</button>
<div class='progress-bar' id='progBar'><div class='progress-fill' id='progFill'></div></div>
<div class='status-msg' id='statusMsg'></div>
<div class='note'>Max size: <span id='maxSize'>-</span> bytes</div>
</div>

<div class='card'><h2>Device Information</h2>
<div style='font-size:12px;line-height:1.8;color:#666'>
<div>Firmware: <span id='fwVersion'>-</span> <span id='fwBuildTime' style='font-size:10px;color:#999'></span></div>
<div>IP Address: <span id='deviceIp'>-</span></div>
<div>WiFi Mode: <span id='wifiMode'>AP</span></div>
<div>Signal: <span id='signal'>-</span></div>
<div>Timezone: <span id='tzDisplay'>UTC</span> <span id='tzMode' style='font-size:10px;color:#999'></span></div>
<div id='tzDebug' style='margin-top:8px;padding:4px;background:#f5f5f5;border-radius:3px;color:#666;font-size:10px;display:none'>
Offset: <span id='tzOffset'>0</span>h (<span id='tzOffsetSec'>0</span>s) | Auto-detected: <span id='tzAuto'>no</span>
</div>
<div style='margin-top:6px;font-size:10px;color:#666'>Detect status: <span id='tzDetectStatus'>-</span></div>
<div style='margin-top:2px;font-size:10px;color:#666'>Detect message: <span id='tzDetectMsg'>-</span></div>
</div></div>

</div>

<script>
let fwFile=null,uploading=false;function updateBrightnessLabel(){const v=document.getElementById('brightness').value;
document.getElementById('brightValue').textContent=v;document.getElementById('brightLabel').textContent=(Math.round(v/255*100))+'%';}
let modeCfgSaveTimer=null,modeCfgPersistTimer=null;
function toggleTzMode(){document.getElementById('manualTz').style.display=document.querySelector('input[name="tzmode"]:checked').value==='manual'?'block':'none';}
function fileSelected(input){const sb=document.getElementById('statusMsg');const ub=document.getElementById('uploadBtn');fwFile=null;ub.disabled=true;
if(input.files.length===0)return;fwFile=input.files[0];document.getElementById('fileName').textContent='ðŸ“„ '+fwFile.name;sb.textContent='Checking firmware...';sb.className='status-msg status-info';
const r=new FileReader();r.onload=()=>{const b=new Uint8Array(r.result);const m=b.length>0?b[0]:0;
fetch('/api/update/precheck?name='+encodeURIComponent(fwFile.name)+'&size='+fwFile.size+'&magic='+m).then(r=>r.json()).then(d=>{
if(d.ok){ub.disabled=false;sb.textContent='âœ“ '+d.summary;sb.className='status-msg status-ok';}else{ub.disabled=true;sb.textContent='âœ— '+d.error;sb.className='status-msg status-err';}}).catch(e=>{ub.disabled=true;sb.textContent='Check failed: '+e;sb.className='status-msg status-err';});};
r.onerror=()=>{ub.disabled=true;sb.textContent='Failed to read file';sb.className='status-msg status-err';};r.readAsArrayBuffer(fwFile.slice(0,1));}
function uploadFirmware(){if(!fwFile||uploading)return;if(!confirm('Upload '+fwFile.name+'?'))return;uploading=true;document.getElementById('uploadBtn').disabled=true;
const sb=document.getElementById('statusMsg');const pb=document.getElementById('progBar');const pf=document.getElementById('progFill');pb.style.display='block';sb.textContent='';
const fd=new FormData();fd.append('firmware',fwFile);const x=new XMLHttpRequest();
x.upload.addEventListener('progress',(e)=>{if(e.lengthComputable)pf.style.width=(e.loaded/e.total*100)+'%';});
x.addEventListener('load',()=>{uploading=false;try{const p=JSON.parse(x.responseText);if(x.status===200&&p.ok){sb.textContent='âœ“ Update OK ('+p.written+' bytes). Rebooting...';sb.className='status-msg status-ok';setTimeout(()=>location.reload(),2000);}else{const e=p?p.error:x.responseText;sb.textContent='âœ— '+e;sb.className='status-msg status-err';document.getElementById('uploadBtn').disabled=false;}}catch(e){sb.textContent='âœ— Upload failed';sb.className='status-msg status-err';document.getElementById('uploadBtn').disabled=false;}});
x.addEventListener('error',()=>{uploading=false;sb.textContent='âœ— Connection error';sb.className='status-msg status-err';document.getElementById('uploadBtn').disabled=false;});
x.open('POST','/api/update?approve=1');x.send(fd);}
var _scanData=[];
function networkSelected(){const list=document.getElementById('ssidList');const ssid=list.value;if(!ssid)return;document.getElementById('wifiSsid').value=ssid;const net=_scanData.find(n=>n.ssid===ssid);const ol=document.getElementById('openLabel');if(net&&!net.enc){document.getElementById('wifiPass').value='';ol.textContent='open network';ol.style.color='#4a4';}else{ol.textContent='';}}
function scanWifi(attempt=0){const list=document.getElementById('ssidList');const sb=document.getElementById('scanBtn');const ss=document.getElementById('scanStatus');
if(attempt===0){ss.textContent='scanning...';sb.disabled=true;list.innerHTML='<option>Scanning...</option>';}
fetch('/api/wifi/scan').then(r=>r.json()).then(d=>{if(d.scanning){if(attempt>25){ss.textContent='timeout';sb.disabled=false;return;}setTimeout(()=>scanWifi(attempt+1),350);return;}
_scanData=d.networks||[];list.innerHTML='';if(!_scanData.length){list.innerHTML='<option>No networks found</option>';ss.textContent='none';sb.disabled=false;return;}
_scanData.forEach(n=>{const o=document.createElement('option');o.value=n.ssid;o.textContent=(n.enc?'\uD83D\uDD12 ':'\uD83D\uDD13 ')+n.ssid+' ('+n.rssi+' dBm)';list.appendChild(o);});
ss.textContent='found '+_scanData.length;sb.disabled=false;}).catch(e=>{list.innerHTML='<option>Scan failed</option>';ss.textContent='error';sb.disabled=false;});}
function pollConnect(s){const msg=document.getElementById('wifiMsg');fetch('/api/wifi/connect').then(r=>r.json()).then(d=>{
if(d.connected){msg.textContent='âœ“ Connected to "'+s+'"! IP: '+d.ip;msg.className='status-msg status-ok';}
else if(d.connecting){msg.textContent='Connecting to "'+s+'"...';setTimeout(()=>pollConnect(s),800);}
else{msg.textContent='âœ— '+(d.error||'Connection failed');msg.className='status-msg status-err';}}).catch(e=>{msg.textContent='Error: '+e;msg.className='status-msg status-err';});}
function connectWifi(){const s=document.getElementById('wifiSsid').value.trim();const p=document.getElementById('wifiPass').value;const msg=document.getElementById('wifiMsg');
if(!s){msg.textContent='Enter or select a network name';msg.className='status-msg status-err';return;}
msg.textContent='Connecting to "'+s+'"'+(p?'':' (open)');msg.className='status-msg status-info';
const sp=new URLSearchParams({ssid:s,pass:p});fetch('/api/wifi/connect?'+sp.toString()).then(r=>r.json()).then(d=>{
if(d.connected){msg.textContent='âœ“ Connected! IP: '+d.ip;msg.className='status-msg status-ok';}
else if(d.connecting){setTimeout(()=>pollConnect(s),800);}
else{msg.textContent='âœ— '+(d.error||'Connection failed');msg.className='status-msg status-err';}}).catch(e=>{msg.textContent='Error: '+e;msg.className='status-msg status-err';});}
function syncNTP(){const msg=document.getElementById('tzMsg');msg.textContent='Syncing...';msg.className='status-msg status-info';
fetch('/api/ntp').then(r=>r.text()).then(t=>{msg.textContent='âœ“ Syncing with NTP server...';msg.className='status-msg status-ok';}).catch(e=>{msg.textContent='âœ— Error: '+e;msg.className='status-msg status-err';});}
function saveTimezone(){const m=document.querySelector('input[name="tzmode"]:checked').value;const o=m==='manual'?document.getElementById('tzOffset').value:'0';
const b=document.getElementById('tzMsg');b.textContent='Saving...';b.className='status-msg status-info';
fetch('/api/timezone?mode='+m+'&offset='+o).then(r=>r.text()).then(t=>{b.textContent='âœ“ Saved!';b.className='status-msg status-ok';}).catch(e=>{b.textContent='âœ— Error: '+e;b.className='status-msg status-err';});}
function saveBrightness(){const v=document.getElementById('brightness').value;fetch('/api/brightness?value='+Math.round(v/255*100)).catch(e=>console.warn(e));}
function saveLedType(){const v=document.getElementById('rgbwToggle').checked?1:0;fetch('/api/ledtype?rgbw='+v).then(r=>r.json()).then(d=>{document.getElementById('rgbwSlider').style.background=d.rgbw?'#4CAF50':'#ccc';document.getElementById('ledTypeLabel').textContent=d.rgbw?'RGBW':'RGB';}).catch(e=>console.warn(e));}
function saveLedDirection(){const v=document.getElementById('revToggle').checked?1:0;fetch('/api/leddirection?reversed='+v).then(r=>r.json()).then(d=>{document.getElementById('revSlider').style.background=d.reversed?'#4CAF50':'#ccc';document.getElementById('ledDirLabel').textContent=d.reversed?'Reversed':'Normal';}).catch(e=>console.warn(e));}
function rgbToHex(r,g,b){return'#'+[r,g,b].map(v=>{const h=Number(v).toString(16);return h.length===1?'0'+h:h;}).join('');}
function hexToRgb(hex){const v=(hex||'#000000').replace('#','');if(v.length!==6)return{r:0,g:0,b:0};return{r:parseInt(v.substring(0,2),16),g:parseInt(v.substring(2,4),16),b:parseInt(v.substring(4,6),16)};}
function updateWidthLabels(){document.getElementById('hourWidthLabel').textContent=document.getElementById('hourWidth').value;
document.getElementById('minuteWidthLabel').textContent=document.getElementById('minuteWidth').value;
document.getElementById('secondWidthLabel').textContent=document.getElementById('secondWidth').value;}
function applyModeCfgToControls(c){if(!c)return;
document.getElementById('hourColor').value=rgbToHex(c.hour.r,c.hour.g,c.hour.b);
document.getElementById('minuteColor').value=rgbToHex(c.minute.r,c.minute.g,c.minute.b);
document.getElementById('secondColor').value=rgbToHex(c.second.r,c.second.g,c.second.b);
document.getElementById('hourWidth').value=c.width.hour;
document.getElementById('minuteWidth').value=c.width.minute;
document.getElementById('secondWidth').value=c.width.second;
document.getElementById('spectrum').value=c.spectrum;updateWidthLabels();}
function loadModeConfig(){const m=document.getElementById('displayMode').value;
fetch('/api/mode/config?mode='+m).then(r=>r.json()).then(d=>{if(d&&d.ok)applyModeCfgToControls(d);}).catch(e=>console.warn(e));}
function buildModeCfgQuery(persist){const m=document.getElementById('displayMode').value;
const h=hexToRgb(document.getElementById('hourColor').value);
const mn=hexToRgb(document.getElementById('minuteColor').value);
const s=hexToRgb(document.getElementById('secondColor').value);
const hw=document.getElementById('hourWidth').value;
const mw=document.getElementById('minuteWidth').value;
const sw=document.getElementById('secondWidth').value;
const sp=document.getElementById('spectrum').value;
return `/api/mode/config?set=1&persist=${persist?1:0}&mode=${m}&hr=${h.r}&hg=${h.g}&hb=${h.b}&mr=${mn.r}&mg=${mn.g}&mb=${mn.b}&sr=${s.r}&sg=${s.g}&sb=${s.b}&hw=${hw}&mw=${mw}&sw=${sw}&sp=${sp}`;}
function queueModeConfigSave(){updateWidthLabels();
if(modeCfgSaveTimer)clearTimeout(modeCfgSaveTimer);
modeCfgSaveTimer=setTimeout(()=>saveModeConfig(true,false),100);
if(modeCfgPersistTimer)clearTimeout(modeCfgPersistTimer);
modeCfgPersistTimer=setTimeout(()=>saveModeConfig(true,true),1200);
}
function saveModeConfig(silent=false,persist=true){
const msg=document.getElementById('modeCfgMsg');
if(!silent){msg.textContent=persist?'Saving mode visuals...':'Applying mode visuals...';msg.className='status-msg status-info';}
const q=buildModeCfgQuery(persist);
fetch(q).then(r=>r.json()).then(d=>{if(d&&d.ok){if(!silent){msg.textContent='âœ“ Mode visuals saved';msg.className='status-msg status-ok';}applyModeCfgToControls(d);}else{msg.textContent='âœ— '+((d&&d.error)||'Failed');msg.className='status-msg status-err';}})
.catch(e=>{msg.textContent='âœ— '+e;msg.className='status-msg status-err';});}
function resetModeConfig(){const m=document.getElementById('displayMode').value;
const msg=document.getElementById('modeCfgMsg');
msg.textContent='Resetting mode visuals...';msg.className='status-msg status-info';
fetch('/api/mode/config?reset=1&persist=1&mode='+m).then(r=>r.json()).then(d=>{
if(d&&d.ok){msg.textContent='âœ“ Mode visuals reset to defaults';msg.className='status-msg status-ok';applyModeCfgToControls(d);}else{msg.textContent='âœ— '+((d&&d.error)||'Failed');msg.className='status-msg status-err';}
}).catch(e=>{msg.textContent='âœ— '+e;msg.className='status-msg status-err';});}
function saveDisplayMode(){const m=document.getElementById('displayMode').value;fetch('/api/display?mode='+m).catch(e=>console.warn(e));updateModeDescription();loadModeConfig();}
function updateModeDescription(){const m=parseInt(document.getElementById('displayMode').value);
const desc={0:'Rainbow orbit background with clear red hour, green minute, and blue second markers (5-3-7 LED spread).',
1:'Minimal clean mode: exactly 3 LEDs each for red hour, green minute, blue second. No background.',
2:'Very subtle background pulse (reduced from before) with strong HMS markers for easy readability.',
3:'Binary clock stretched across all 60 LEDs: 20 groups Ã— 3 LEDs showing hour/minute/second bits in color.',
4:'Minute fills like a progress bar, hour shown as bright beacon, second has moving trail.',
5:'Optimized warm flame effect (20fps update) with clear HMS markers. Performance improved.',
6:'Soft pastel colors: pink hour, mint green minute, sky blue second. Gentle and easy on eyes.',
7:'Bright neon colors: magenta hour, cyan minute, yellow second. Vivid and energetic.',
8:'Animated comet trails: red hour (7 LED), green minute (5 LED), blue second (10 LED fast tail).'};
document.getElementById('modeDesc').textContent=desc[m]||'Mode '+m;}
function pollStatus(){fetch('/api/status').then(r=>r.json()).then(d=>{
document.getElementById('fwVersion').textContent=d.fw_version_base||'-';
document.getElementById('fwBuildTime').textContent='('+d.fw_build_time+')';
document.getElementById('deviceIp').textContent=d.ip||'-';
document.getElementById('wifiMode').textContent=d.wifi_connected?'STA (Connected)':'AP (Hotspot)';
document.getElementById('signal').textContent=d.wifi_connected?(d.wifi_rssi+' dBm'):'(AP mode)';
document.getElementById('tzDisplay').textContent=d.timezone||'UTC';
document.getElementById('tzMode').textContent=(d.timezone_auto_detected?'auto':'manual');
document.getElementById('tzOffset').textContent=d.timezone_utc_offset_hours;
document.getElementById('tzOffsetSec').textContent=d.timezone_utc_offset_seconds;
document.getElementById('tzAuto').textContent=d.timezone_auto_detected?'yes':'no';
document.getElementById('tzDetectStatus').textContent=d.tz_detect_status||'-';
document.getElementById('tzDetectMsg').textContent=d.tz_detect_message||'-';
document.getElementById('tzDebug').style.display='block';
if(d.display_mode!==undefined){
const current=document.getElementById('displayMode').value;
document.getElementById('displayMode').value=d.display_mode;
updateModeDescription();
if(String(current)!==String(d.display_mode)){loadModeConfig();}
}
if(d.display_cfg){applyModeCfgToControls(d.display_cfg);}
if(d.led_rgbw!==undefined){const isRgbw=d.led_rgbw===true;document.getElementById('rgbwToggle').checked=isRgbw;document.getElementById('rgbwSlider').style.background=isRgbw?'#4CAF50':'#ccc';document.getElementById('ledTypeLabel').textContent=isRgbw?'RGBW':'RGB';}
if(d.led_reversed!==undefined){const isRev=d.led_reversed===true;document.getElementById('revToggle').checked=isRev;document.getElementById('revSlider').style.background=isRev?'#4CAF50':'#ccc';document.getElementById('ledDirLabel').textContent=isRev?'Reversed':'Normal';}
}).catch(e=>console.warn(e));}
function getMaxSize(){fetch('/api/status').then(r=>r.json()).then(d=>{document.getElementById('maxSize').textContent=(d.heap||262144).toString();}).catch(e=>console.warn(e));}
document.getElementById('hourWidth').addEventListener('input',updateWidthLabels);
document.getElementById('minuteWidth').addEventListener('input',updateWidthLabels);
document.getElementById('secondWidth').addEventListener('input',updateWidthLabels);
document.getElementById('hourColor').addEventListener('input',queueModeConfigSave);
document.getElementById('minuteColor').addEventListener('input',queueModeConfigSave);
document.getElementById('secondColor').addEventListener('input',queueModeConfigSave);
document.getElementById('hourWidth').addEventListener('input',queueModeConfigSave);
document.getElementById('minuteWidth').addEventListener('input',queueModeConfigSave);
document.getElementById('secondWidth').addEventListener('input',queueModeConfigSave);
document.getElementById('spectrum').addEventListener('change',queueModeConfigSave);
document.getElementById('hourColor').addEventListener('change',()=>saveModeConfig(true,true));
document.getElementById('minuteColor').addEventListener('change',()=>saveModeConfig(true,true));
document.getElementById('secondColor').addEventListener('change',()=>saveModeConfig(true,true));
document.getElementById('hourWidth').addEventListener('change',()=>saveModeConfig(true,true));
document.getElementById('minuteWidth').addEventListener('change',()=>saveModeConfig(true,true));
document.getElementById('secondWidth').addEventListener('change',()=>saveModeConfig(true,true));
document.getElementById('spectrum').addEventListener('change',()=>saveModeConfig(true,true));
pollStatus();getMaxSize();scanWifi();setInterval(pollStatus,5000);updateModeDescription();loadModeConfig();updateWidthLabels();
</script></body></html>
)html";

// ============================================================================
// Web Server Setup
// ============================================================================

void setupWebServer() {
  // Main page - just clock & status
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *req) { 
    req->send_P(200, "text/html", INDEX_HTML); 
  });
  
  // Settings page
  server.on("/settings.html", HTTP_GET, [](AsyncWebServerRequest *req) { 
    req->send_P(200, "text/html", SETTINGS_HTML); 
  });
  
  // API: Status
  server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest *req) {
    DynamicJsonDocument doc(1408);
    time_t now = time(nullptr);
    struct tm* t = localtime(&now);
    String fullVersion = String(FW_VERSION_BASE) + " (" + FW_BUILD_TIME + ")";
    doc["fw_version"] = fullVersion;
    doc["fw_version_base"] = FW_VERSION_BASE;
    doc["fw_build_time"] = FW_BUILD_TIME;
    doc["time_hour"] = t->tm_hour;
    doc["time_minute"] = t->tm_min;
    doc["time_second"] = t->tm_sec;
    doc["ntp_synced"] = (now > 86400);
    doc["wifi_connected"] = wifiConnected;
    doc["wifi_ssid"] = WiFi.SSID();
    doc["wifi_rssi"] = wifiConnected ? WiFi.RSSI() : 0;
    doc["timezone"] = tz.name;
    doc["timezone_auto_detected"] = tz.autoDetected;
    doc["timezone_utc_offset_hours"] = tz.utcOffset / 3600;
    doc["timezone_utc_offset_seconds"] = tz.utcOffset;
    doc["tz_detect_source"] = tzDiag.source;
    doc["tz_detect_status"] = tzDiag.status;
    doc["tz_detect_message"] = tzDiag.message;
    doc["tz_detect_http_code"] = tzDiag.httpCode;
    doc["tz_detect_last_attempt_ms"] = tzDiag.lastAttemptMs;
    doc["tz_detect_last_success_ms"] = tzDiag.lastSuccessMs;
    doc["tz_detect_response_sample"] = tzDiag.responseSample;
    doc["brightness"] = (ledBrightness * 100) / 255;
    doc["led_rgbw"] = ledRgbw;
    doc["led_reversed"] = ledReversed;
    doc["display_mode"] = (int)displayMode;
    doc["boot_stage"] = (int)bootStage;
    const char* stageNames[] = {"Booting","AP Ready","Scanning","Connecting","WiFi OK","NTP Wait"};
    doc["boot_stage_name"] = bootStage <= BOOT_STAGE_NTP_WAIT ? stageNames[(int)bootStage] : "Done";
    bool clockShowing = ((now >= 86400) || forceClockDisplay) && !forceStatusDisplay;
    doc["ring_mode"] = clockShowing ? "clock" : "status";
    doc["ring_force_clock"] = forceClockDisplay;
    doc["ring_force_status"] = forceStatusDisplay;
    const ModeDisplayConfig &cfg = modeConfigs[(int)displayMode];
    doc["display_cfg"]["hour"]["r"] = cfg.hourR;
    doc["display_cfg"]["hour"]["g"] = cfg.hourG;
    doc["display_cfg"]["hour"]["b"] = cfg.hourB;
    doc["display_cfg"]["minute"]["r"] = cfg.minuteR;
    doc["display_cfg"]["minute"]["g"] = cfg.minuteG;
    doc["display_cfg"]["minute"]["b"] = cfg.minuteB;
    doc["display_cfg"]["second"]["r"] = cfg.secondR;
    doc["display_cfg"]["second"]["g"] = cfg.secondG;
    doc["display_cfg"]["second"]["b"] = cfg.secondB;
    doc["display_cfg"]["width"]["hour"] = cfg.hourWidth;
    doc["display_cfg"]["width"]["minute"] = cfg.minuteWidth;
    doc["display_cfg"]["width"]["second"] = cfg.secondWidth;
    doc["display_cfg"]["spectrum"] = cfg.spectrum;
    doc["ip"] = wifiConnected ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
    doc["heap"] = ESP.getFreeHeap();
    String json;
    serializeJson(doc, json);
    req->send(200, "application/json", json);
  });
  
  // API: WiFi Scan
  server.on("/api/wifi/scan", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getWifiScanJson());
  });
  
  // API: WiFi Connect
  server.on("/api/wifi/connect", HTTP_GET, [](AsyncWebServerRequest *req) {
    DynamicJsonDocument doc(256);
    
    if (req->hasParam("ssid")) {
      String ssid = req->getParam("ssid")->value();
      String pass = req->hasParam("pass") ? req->getParam("pass")->value() : "";
      
      if (startWiFiConnect(ssid, pass, true)) {
        doc["connecting"] = true;
      } else {
        doc["connecting"] = false;
        doc["error"] = "Connection already in progress or invalid SSID";
      }
    } else {
      updateWiFiConnect();
      if (wifiConnect.active) {
        doc["connecting"] = true;
      } else if (wifiConnect.success) {
        doc["connecting"] = false;
        doc["connected"] = true;
        doc["ip"] = WiFi.localIP().toString();
        wifiConnect.success = false;
      } else {
        doc["connecting"] = false;
        doc["connected"] = wifiConnected;
        if (wifiConnect.error.length() > 0) {
          doc["error"] = wifiConnect.error;
          wifiConnect.error = "";
        }
      }
    }
    
    String json;
    serializeJson(doc, json);
    req->send(200, "application/json", json);
  });
  
  // API: Brightness
  server.on("/api/brightness", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("value")) {
      int val = atoi(req->getParam("value")->value().c_str());
      ledBrightness = (val * 255) / 100;
      if (ledStrip) ledStrip->setBrightness(ledBrightness);
    }
    req->send(200, "text/plain", "OK");
  });

  // API: LED type (RGB / RGBW)
  server.on("/api/ledtype", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("rgbw")) {
      bool newRgbw = (req->getParam("rgbw")->value() == "1");
      if (newRgbw != ledRgbw) {
        ledRgbw = newRgbw;
        EEPROM.begin(EEPROM_SIZE);
        EEPROM.write(EEPROM_RGBW_ADDR, ledRgbw ? 0x01 : 0x00);
        EEPROM.commit();
        setupLEDs();  // reinit strip with correct pixel type
        Serial.printf("[LED] Switched to %s mode\n", ledRgbw ? "RGBW" : "RGB");
      }
    }
    String json = String("{\"rgbw\":") + (ledRgbw ? "true" : "false") + "}";
    req->send(200, "application/json", json);
  });
  
