noless-zz/esp8266-led-strip-clock/src/main.cpp
  // API: LED direction
  server.on("/api/leddirection", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("reversed")) {
      bool newReversed = (req->getParam("reversed")->value() == "1");
      if (newReversed != ledReversed) {
        ledReversed = newReversed;
        EEPROM.begin(EEPROM_SIZE);
        EEPROM.write(EEPROM_REVERSED_ADDR, ledReversed ? 0x01 : 0x00);
        EEPROM.commit();
        Serial.printf("[LED] Direction: %s\n", ledReversed ? "reversed" : "normal");
      }
    }
    String json = String("{\"reversed\":") + (ledReversed ? "true" : "false") + "}";
    req->send(200, "application/json", json);
  });

  // API: Ring control â€” force_clock=1 â†’ show clock, force_clock=0 â†’ show status animation
  server.on("/api/ring", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("force_clock")) {
      bool wantClock = (req->getParam("force_clock")->value() == "1");
      forceClockDisplay  = wantClock;
      forceStatusDisplay = !wantClock;
    }
    bool ntpSynced = (time(nullptr) >= 86400);
    bool clockShowing = (ntpSynced || forceClockDisplay) && !forceStatusDisplay;
    const char* stageNames[] = {"Booting","AP Ready","Scanning","Connecting","WiFi OK","NTP Wait"};
    String json = String("{\"ring_mode\":\"") + (clockShowing ? "clock" : "status") +
                  "\",\"boot_stage\":" + (int)bootStage +
                  ",\"boot_stage_name\":\"" + (bootStage <= BOOT_STAGE_NTP_WAIT ? stageNames[(int)bootStage] : "Done") +
                  "\",\"force_clock\":" + (forceClockDisplay ? "true" : "false") +
                  ",\"force_status\":" + (forceStatusDisplay ? "true" : "false") + "}";
    req->send(200, "application/json", json);
  });

  // API: Display Mode
  server.on("/api/display", HTTP_GET, [](AsyncWebServerRequest *req) {
    DynamicJsonDocument doc(512);
    doc["current_mode"] = displayMode;
    doc["available_modes"]["SOLID"] = DISPLAY_SOLID;
    doc["available_modes"]["SIMPLE"] = DISPLAY_SIMPLE;
    doc["available_modes"]["PULSE"] = DISPLAY_PULSE;
    doc["available_modes"]["BINARY"] = DISPLAY_BINARY;
    doc["available_modes"]["HOUR_MARKER"] = DISPLAY_HOUR_MARKER;
    doc["available_modes"]["FLAME"] = DISPLAY_FLAME;
    doc["available_modes"]["PASTEL"] = DISPLAY_PASTEL;
    doc["available_modes"]["NEON"] = DISPLAY_NEON;
    doc["available_modes"]["COMET"] = DISPLAY_COMET;
    
    if (req->hasParam("mode")) {
      int newMode = atoi(req->getParam("mode")->value().c_str());
      if (newMode >= 0 && newMode < DISPLAY_MAX) {
        displayMode = (DisplayMode)newMode;
        saveDisplayModeToEEPROM();
        doc["changed"] = true;
        doc["new_mode"] = displayMode;
      } else {
        doc["error"] = "Invalid mode";
      }
    }

    const ModeDisplayConfig &cfg = modeConfigs[(int)displayMode];
    doc["config"]["hour"]["r"] = cfg.hourR;
    doc["config"]["hour"]["g"] = cfg.hourG;
    doc["config"]["hour"]["b"] = cfg.hourB;
    doc["config"]["minute"]["r"] = cfg.minuteR;
    doc["config"]["minute"]["g"] = cfg.minuteG;
    doc["config"]["minute"]["b"] = cfg.minuteB;
    doc["config"]["second"]["r"] = cfg.secondR;
    doc["config"]["second"]["g"] = cfg.secondG;
    doc["config"]["second"]["b"] = cfg.secondB;
    doc["config"]["width"]["hour"] = cfg.hourWidth;
    doc["config"]["width"]["minute"] = cfg.minuteWidth;
    doc["config"]["width"]["second"] = cfg.secondWidth;
    doc["config"]["spectrum"] = cfg.spectrum;
    
    String response;
    serializeJson(doc, response);
    req->send(200, "application/json", response);
  });

  // API: Display Mode Configuration (per mode, persistent)
  server.on("/api/mode/config", HTTP_GET, [](AsyncWebServerRequest *req) {
    DynamicJsonDocument doc(512);

    int mode = (int)displayMode;
    if (req->hasParam("mode")) {
      mode = atoi(req->getParam("mode")->value().c_str());
    }

    if (mode < 0 || mode >= DISPLAY_MAX) {
      doc["ok"] = false;
      doc["error"] = "Invalid mode";
      String out;
      serializeJson(doc, out);
      req->send(400, "application/json", out);
      return;
    }

    bool shouldPersist = false;

    if (req->hasParam("reset")) {
      modeConfigs[mode] = defaultModeConfigFor((uint8_t)mode);
      shouldPersist = true;
      doc["reset"] = true;
    }

    if (req->hasParam("set")) {
      ModeDisplayConfig cfg = modeConfigs[mode];
      auto parseByte = [&](const char* key, uint8_t currentValue) -> uint8_t {
        if (!req->hasParam(key)) return currentValue;
        int v = atoi(req->getParam(key)->value().c_str());
        if (v < 0) v = 0;
        if (v > 255) v = 255;
        return (uint8_t)v;
      };

      auto parseWidth = [&](const char* key, uint8_t currentValue) -> uint8_t {
        if (!req->hasParam(key)) return currentValue;
        int v = atoi(req->getParam(key)->value().c_str());
        if (v < 1) v = 1;
        if (v > 30) v = 30;
        return (uint8_t)v;
      };

      cfg.hourR = parseByte("hr", cfg.hourR);
      cfg.hourG = parseByte("hg", cfg.hourG);
      cfg.hourB = parseByte("hb", cfg.hourB);
      cfg.minuteR = parseByte("mr", cfg.minuteR);
      cfg.minuteG = parseByte("mg", cfg.minuteG);
      cfg.minuteB = parseByte("mb", cfg.minuteB);
      cfg.secondR = parseByte("sr", cfg.secondR);
      cfg.secondG = parseByte("sg", cfg.secondG);
      cfg.secondB = parseByte("sb", cfg.secondB);
      cfg.hourWidth = parseWidth("hw", cfg.hourWidth);
      cfg.minuteWidth = parseWidth("mw", cfg.minuteWidth);
      cfg.secondWidth = parseWidth("sw", cfg.secondWidth);
      cfg.spectrum = (uint8_t)min(2, max(0, req->hasParam("sp") ? atoi(req->getParam("sp")->value().c_str()) : (int)cfg.spectrum));

      if (!isModeConfigValid(cfg)) {
        doc["ok"] = false;
        doc["error"] = "Invalid config values";
        String out;
        serializeJson(doc, out);
        req->send(400, "application/json", out);
        return;
      }

      modeConfigs[mode] = cfg;
      int persistFlag = req->hasParam("persist") ? atoi(req->getParam("persist")->value().c_str()) : 1;
      if (persistFlag != 0) shouldPersist = true;
      doc["saved"] = true;
      doc["persisted"] = (persistFlag != 0);
    }

