noless-zz/esp8266-led-strip-clock/src/main.cpp
    if (shouldPersist) {
      saveModeConfigToEEPROM((uint8_t)mode);
      doc["persisted"] = true;
    }

    const ModeDisplayConfig &cfg = modeConfigs[mode];
    doc["ok"] = true;
    doc["mode"] = mode;
    doc["hour"]["r"] = cfg.hourR;
    doc["hour"]["g"] = cfg.hourG;
    doc["hour"]["b"] = cfg.hourB;
    doc["minute"]["r"] = cfg.minuteR;
    doc["minute"]["g"] = cfg.minuteG;
    doc["minute"]["b"] = cfg.minuteB;
    doc["second"]["r"] = cfg.secondR;
    doc["second"]["g"] = cfg.secondG;
    doc["second"]["b"] = cfg.secondB;
    doc["width"]["hour"] = cfg.hourWidth;
    doc["width"]["minute"] = cfg.minuteWidth;
    doc["width"]["second"] = cfg.secondWidth;
    doc["spectrum"] = cfg.spectrum;

    String out;
    serializeJson(doc, out);
    req->send(200, "application/json", out);
  });
  
  // API: Timezone
  server.on("/api/timezone", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("mode")) {
      if (req->getParam("mode")->value() == "auto") {
        tz.autoDetected = true;
        tzDiag.status = "running";
        tzDiag.message = "auto mode requested";
        detectTimezone();
        req->send(200, "text/plain", "Auto-detecting...");
      } else if (req->hasParam("offset")) {
        tz.utcOffset = (int32_t)(atof(req->getParam("offset")->value().c_str()) * 3600);
        tz.autoDetected = false;
        tz.name = "Manual";
        syncTimeNTP();
        req->send(200, "text/plain", "Manual timezone set");
      } else {
        req->send(400, "text/plain", "Missing offset param");
      }
    } else {
      req->send(400, "text/plain", "Missing mode param");
    }
  });
  
  // API: NTP Sync
  server.on("/api/ntp", HTTP_GET, [](AsyncWebServerRequest *req) {
    syncTimeNTP();
    req->send(200, "text/plain", "Syncing...");
  });
  
  // API: OTA Precheck
  server.on("/api/update/precheck", HTTP_GET, [](AsyncWebServerRequest *req) {
    DynamicJsonDocument doc(256);
    if (!req->hasParam("name") || !req->hasParam("size") || !req->hasParam("magic")) {
      doc["ok"] = false;
      doc["error"] = "Missing parameters";
    } else {
      String name = req->getParam("name")->value();
      size_t size = (size_t) req->getParam("size")->value().toInt();
      int magic = req->getParam("magic")->value().toInt();
      uint32_t maxSize = getMaxUpdateSize();
      
      bool extOk = name.endsWith(".bin") || name.endsWith(".BIN");
      bool sizeOk = size > 0 && size <= maxSize;
      bool magicOk = (magic == 0xE9);
      
      doc["ok"] = extOk && sizeOk && magicOk;
      if (doc["ok"].as<bool>()) {
        doc["summary"] = String(name + " (" + String(size) + " bytes)");
      } else {
        String err;
        if (!extOk) err += "Invalid file type (must be .bin). ";
        if (!sizeOk) err += "File too large (max " + String(maxSize) + " bytes). ";
        if (!magicOk) err += "Invalid firmware magic. ";
        doc["error"] = err;
      }
    }
    String json;
    serializeJson(doc, json);
    req->send(200, "application/json", json);
  });
  
  // API: OTA Upload
  server.on("/api/update", HTTP_POST,
    [](AsyncWebServerRequest *req) {
      bool success = !Update.hasError() && Update.isFinished();
      req->send(success ? 200 : 500, "application/json", 
        String("{\"ok\":") + (success ? "true" : "false") + ",\"written\":" + String(Update.progress()) + "}");
      if (success) {
        delay(500);
        ESP.restart();
      }
    },
    [](AsyncWebServerRequest *req, String filename, size_t index, uint8_t *data, size_t len, bool final) {
      if (index == 0) {
        Update.runAsync(true);
        uint32_t maxSize = getMaxUpdateSize();
        if (!Update.begin(maxSize, U_FLASH)) {
          Serial.println("[OTA] Update begin failed");
          return;
        }
        Serial.print("[OTA] Updating: ");
        Serial.println(filename);
      }
      
      if (Update.write(data, len) == len) {} else {
        Update.printError(Serial);
      }
      
      if (final) {
        if (Update.end(true)) {
          Serial.println("\n[OTA] Update Success!");
        } else {
          Serial.println("\n[OTA] Update Failed!");
          Update.printError(Serial);
        }
      }
    }
  );
  
  // Catchall
  server.onNotFound([](AsyncWebServerRequest *req) {
    req->redirect("http://" + WiFi.softAPIP().toString() + "/");
  });
  
  server.begin();
  Serial.println("[Web] Server started @ http://192.168.4.1");
}

void setupWiFi() {
  Serial.println("[WiFi] Starting AP+STA mode...");
  WiFi.mode(WIFI_AP_STA);

  // Log when a device connects/disconnects from our AP
  WiFi.onSoftAPModeStationConnected([](const WiFiEventSoftAPModeStationConnected& e) {
    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
             e.mac[0], e.mac[1], e.mac[2], e.mac[3], e.mac[4], e.mac[5]);
    Serial.printf("[AP] Client connected:    MAC=%s  aid=%d  clients=%d\n",
                  mac, e.aid, WiFi.softAPgetStationNum());
  });
  WiFi.onSoftAPModeStationDisconnected([](const WiFiEventSoftAPModeStationDisconnected& e) {
    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
             e.mac[0], e.mac[1], e.mac[2], e.mac[3], e.mac[4], e.mac[5]);
    Serial.printf("[AP] Client disconnected: MAC=%s  aid=%d  clients=%d\n",
                  mac, e.aid, WiFi.softAPgetStationNum());
  });

  WiFi.softAP(AP_SSID, AP_PASS);
  bootStage = BOOT_STAGE_AP_UP;
  Serial.println("[WiFi] AP: " + String(AP_SSID));
  Serial.println("[WiFi] AP IP: " + WiFi.softAPIP().toString());

}

void setupDNS() {
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
  Serial.println("[DNS] Captive portal ready");
}

void setupOTA() {
  ArduinoOTA.setPassword(OTA_PASS);
  ArduinoOTA.begin();
  Serial.println("[OTA] Ready");
}

// ============================================================================
// Main Setup & Loop
// ============================================================================

void setup() {
  Serial.begin(115200);
  delay(100);

